export default {
  projections: {
    ЖурналE: {
      курс: {
        __caption__: 'Курс'
      },
      итог: {
        __caption__: 'Итог'
      },
      дисциплина: {
        __caption__: 'Дисциплина',
        название: {
          __caption__: 'Название'
        }
      },
      домашка: {
        __caption__: 'Домашка',
        тема: {
          __caption__: 'Тема'
        },
        дата: {
          __caption__: 'Дата'
        },
        оценка: {
          __caption__: 'Оценка'
        }
      }
    },
    ЖурналL: {
      курс: {
        __caption__: 'Курс'
      },
      итог: {
        __caption__: 'Итог'
      },
      дисциплина: {
        __caption__: 'Название',
        название: {
          __caption__: 'Название'
        }
      }
    }
  },
  validations: {
    курс: {
      __caption__: 'Курс'
    },
    итог: {
      __caption__: 'Итог'
    },
    дисциплина: {
      __caption__: 'Дисциплина'
    },
    домашка: {
      __caption__: 'Домашка'
    }
  }
};
